app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @post = Post.new
    @posts = Post.all.order(created_at: :desc)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 10]]
---
  def detailPost
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id: @post.id).count

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "LALALAND"], ["created_at", "2019-07-11 01:49:02.498990"], ["updated_at", "2019-07-11 01:49:02.498990"], ["user_id", 2]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def create
    @post = Post.new(content: params[:content], user_id: session[:user_id])
    if @post.save
      if params[:image]
        @post.image_name = "#{@post.id}.jpg"
        image = params[:image]
        File.binwrite("public/post_image/#{@post.image_name}", image.read)
        @post.save
      end
      flash[:notice] = "投稿を作成しました"
      redirect_to("/posts/#{@current_user.id}/follows")
    else
      @posts = Post.all.order(created_at: :desc)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def editPost
    @post = Post.find_by(id: params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 10]]
---
  def destroy
    @post = Post.find_by(id: params[:id])
    if @post.image_name
      FileUtils.rm("public/post_image/#{@post.image_name}")
    end
    @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IS NULL
---
  def destroy_not_exist_user_posts
    destroy_posts = Post.where(user_id: @destroy_user)
    destroy_posts.each do |post|

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def ensure_correct_user
    @post = Post.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def follows
    @post = Post.new
    @user = User.find_by(id: params[:id])